import DismissableCard from "@/components/dismissable-card";
import {
  Card,
  CardBody,
  CardFooter,
  CardHeader,
  Chip,
} from "@nextui-org/react";

export default function Page() {
  return (
    <div className="gap-4 grid p-4 grid-cols-1">
      {[
        "以铜为鉴，可整衣冠；以古为鉴，可知兴替。",
        "一片能教一断肠，可堪平砌更堆墙。",
        "霜皮溜雨四十围，黛色参天二千尺。",
        "月色入高楼，相思两处愁。",
        "三十六宫花溅泪，春声何处说兴亡，燕双双。",
        "昔日芙蓉花，今成断根草。",
        "我闭南楼看道书，幽帘清寂在仙居。",
        "城阙辅三秦，风烟望五津。",
        "不可以一时之得意，而自夸其能；亦不可以一时之失意，而自坠其志。",
        "青青子衿，悠悠我心。",
        "或为出师表，鬼神泣壮烈。",
        "当言而不言，尔之责也；言而不听，我之咎也。",
        "雁过斜阳，草迷烟渚。",
        "新啼痕压旧啼痕，断肠人忆断肠人。",
        "未能抛得杭州去，一半勾留是此湖。",
        "陇头流水，流离山下。",
        "马毛带雪汗气蒸，五花连钱旋作冰，幕中草檄砚水凝。",
        "二月湖水清，家家春鸟鸣。",
        "倚南窗以寄傲，审容膝之易安。",
        "白玉谁家郎，回车渡天津。",
        "货无大小，缺者便贵。",
        "学而不厌，诲人不倦",
        "『居安思危。』思则有备，有备无患",
        "禅心已作沾泥絮，不逐春风上下狂。",
        "叠嶂西驰，万马回旋，众山欲东。",
        "恶之者众则危。",
        "不寝听金钥，因风想玉珂。",
        "马上逢寒食，愁中属暮春。",
        "重阳独酌杯中酒，抱病起登江上台。",
        "别离还有经年客，怅望不如河鼓星。",
        "昔时贤文，诲汝谆谆。",
        "暑退九霄净，秋澄万景清。",
        "秋雨晴时泪不晴。",
        "月明星稀，乌鹊南飞。绕树三匝，何枝可依？",
        "忆昔午桥桥上饮，坐中多是豪英。",
        "草深虫子密，林大鸟儿多。",
        "坤至柔而动也刚，至静而德方，后得主而有常，含万物而化光。",
        "地下千年骨，谁为辅佐臣。",
        "只羡鸳鸯不羡仙",
        "天问复招魂，无因彻帝阍。",
        "问讯湖边春色，重来又是三年。",
        "词客有灵应识我，霸才无主独怜君。",
        "愿此生终老温柔，白云不羡仙乡。",
        "见怪不怪，其怪自败。",
        "夜来风雨声，花落知多少。",
        "有钱难买不死方，有钱难买不无常。",
        "昔我同门友，高举振六翮。",
        "一把青秧趁手青，轻烟漠漠雨冥冥。",
        "朝来灞水桥边问，未抵青袍送玉珂。",
        "世所相信，在能行，不在能言。",
      ].map((_, i) => (
        <Card key={i} className="bg-content1" shadow="sm">
          <CardBody>
            <p className="text-large font-medium">{_}</p>
            <p className="text-default-600 font-light mt-1">
              宋 · 陆游《{_.substring(0, 7)}》
            </p>
          </CardBody>
          <CardFooter className="gap-2">
            <Chip variant="flat" color={i % 2 ? "primary" : "secondary"}>
              {_.substring(0, 4)}
            </Chip>
            <Chip variant="flat">{_.substring(4, 10)}</Chip>
          </CardFooter>
        </Card>
      ))}
    </div>
  );
}
